# Brewfile — install everything: brew bundle --file=~/dotfiles/Brewfile
# Update this file from current system: brew bundle dump --file=~/dotfiles/Brewfile --force

# CLI tools (formulae)
brew "git"
brew "starship"
brew "neovim"
brew "bat"
brew "lsd"
brew "thefuck"
brew "mcfly"
brew "direnv"
brew "uv"
brew "mise"
brew "fzf"
brew "kubectl"
brew "helm"
brew "k9s"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "tldr"
brew "delta"
brew "lazygit"
brew "zoxide"
brew "btop"
brew "trivy"
brew "kubeconform"
brew "gum"
brew "just"
brew "shellcheck"
brew "git-flow"
brew "tmux"
brew "tpm"
brew "stow"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps (casks)
cask "ghostty"

# Fonts (Nerd Font for Ghostty / Starship icons; fonts are in main homebrew-cask now)
cask "font-jetbrains-mono-nerd-font"
